app/Models/Category_model.php

    function getCategoryInfo() {
        $builder = $this->db->table('categories');

        $res = $builder->get()->getResult();
---
SELECT *
FROM `categories`

    function insertCategory($data) {
        $builder = $this->db->table('categories');

        $res = $builder->insert($data);
---
INSERT INTO `categories` (`category_name`) VALUES ('Luxury Watch API Updated')

    function updateCategory($data, $categoryID) {
        $builder = $this->db->table('categories');
        $builder->set($data);
        $builder->where('category_id', $categoryID);
        $res = $builder->update();
---
UPDATE `categories` SET `category_id` = '4', `category_name` = 'Luxury Watch API Updated 2'
WHERE `category_id` = '4'

    function deleteCategory($categoryID) {
        $builder = $this->db->table('categories');
        $builder->where('category_id', $categoryID);
        $res = $builder->delete();
---
DELETE FROM `categories`
WHERE `category_id` = '3'