app/Models/Product_model.php

    function getProductInfo() {
        $builder = $this->db->table('products');

        $res = $builder->get()->getResult();
---
SELECT *
FROM `products`

    function getProductInfoByID($productID) {
        $builder = $this->db->table('products');
        $builder->where('product_id', $productID);
        $res = $builder->get()->getRow();
---
SELECT *
FROM `products`
WHERE `product_id` = '2'

    function insertProduct($data) {
        $builder = $this->db->table('products');

        $res = $builder->insert($data);
---
INSERT INTO `products` (`product_category`, `product_name`, `product_description`, `product_price`, `product_quantity`, `product_slug`) VALUES ('Smart Watch', 'Smart Watch Created by API', 'Smart Watch desc Created by API', '1000', '2', 'Smart Watch Created by API')

    function updateProduct($data, $productID) {
        $builder = $this->db->table('products');
        $builder->set($data);
        $builder->where('product_id', $productID);
        $res = $builder->update();
---
UPDATE `products` SET `product_id` = '6', `product_category` = 'Smart Watch', `product_name` = 'Smart Watch Created by API Updated', `product_description` = 'Smart Watch desc Created by API', `product_price` = '1000', `product_quantity` = '2', `product_slug` = 'Smart Watch Created by API'
WHERE `product_id` = '6'

    function deleteProduct($productID) {
        $builder = $this->db->table('products');
        $builder->where('product_id', $productID);
        $res = $builder->delete();
---
DELETE FROM `products`
WHERE `product_id` = '4'