app/Models/Student_model.php

SELECT *
FROM `student`
---
    function getStudentInfo() {
        $builder = $this->db->table('student');

        $res = $builder->get()->getResult();

SELECT *
FROM `student`
WHERE `StudentNo` = 'C21101173'
---
    function getStudentInfoBySN($SN) {
        $builder = $this->db->table('student');
        $builder->where('StudentNo', $SN);
        $res = $builder->get()->getRow();

DELETE FROM `student`
WHERE `StudentNo` = 'sasas'
---
    function deleteStudentRecord($SN) {
        $builder = $this->db->table('student');
        $builder->where('StudentNo', $SN);
        $res = $builder->delete();